# Size Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
AssetProperties..::..Size Property
AssetProperties Class See Also
---
The number of the AssetProperty(s) in the object.
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public int Size { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Size As Integer
	Get
```

Visual C++
---
```text
public:
property int Size {
	int get ();
}
```

# See Also
AssetProperties Class
Autodesk.Revit.DB.Visual Namespace